{
  "experience": {
    "title": "Experience",
    "details": "Details",
    "technologiesUsed": "Technologies used",
    "softskills": "Soft skills",
    "files": "Files",
    "lhs": {
      "key": "internship",
      "title": "Web Developer Intern",
      "company": "LHS by Spot Group",
      "location": "Putte, Belgium",
      "date": "Feb 2024 - May 2024",
      "description": "While at LHS, I spent most of my time working on a booking tool they were gearing up to sell. I focused on making the front-end part of the tool using Django and Tailwind. Basically, I made it look good and easy to use. I also helped out with the back-end where necessary. My internship at LHS taught me a lot about building web applications, dealing with customer requests, and getting things done on my own. It also gave me the opportunity to work on professional communication and gave me insight on the differences between college projects and corporate projects. I'm glad I had the opportunity to work at LHS and I'm looking forward to my next opportunity!",
      "technologies": [
        "Django",
        "HTML",
        "CSS",
        "JavaScript",
        "TailwindCSS",
        "Git",
        "Trello",
        "Docker",
        "PostgreSQL",
        "Figma"
      ],
      "softskills": [
        "Teamwork",
        "Communication",
        "Problem-solving",
        "Time management",
        "Attention to detail"
      ],
      "files": [
        "/assets/files/internship/Plan of approach - Tymo Verhaegen.pdf",
        "/assets/files/internship/Realisation document - Tymo Verhaegen.pdf",
        "/assets/files/internship/Reflection - Tymo Verhaegen.pdf"
      ],
      "comment": ""
    },
    "thomasMore": {
      "key": "education",
      "title": "Bachelor of Applied Computer Science",
      "company": "Thomas More University of Applied Sciences",
      "location": "Geel, Belgium",
      "date": "Sep 2021 - Present",
      "description": "I am studying Applied Computer Science at Thomas More University of Applied Sciences. During my studies, I learned a lot about software development, databases, networking, and much more. I also learned how to work in a team and how to deal with project deadlines. I had a great time at Thomas More and I am looking forward to my next opportunity!",
      "technologies": [
        "HTML",
        "CSS",
        "React",
        "Angular",
        "Laravel",
        "TailwindCSS",
        "Flutter",
        "Java",
        "SQL",
        "Git",
        "Trello",
        "NPM"
      ],
      "softskills": [
        "Teamwork",
        "Communication",
        "Problem-solving",
        "Conflict resolution"
      ],
      "files": [],
      "comment": "Since I've spent three years studying and learning new things here, there are a lot of technologies I've worked with. But these are the ones I've worked with the most and that I think are the most important ones for my future. In the section 'Projects' you can see some of the projects I've worked on during my studies."
    }
  }
}